---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BoundingBoxIntersectsFilter
source: html/7ef1b6ab-3aaa-3ac3-34c3-81d7b44534be.htm
---
# BoundingBoxIntersectsFilter Members

Constructs a new instance of a filter to match elements with a bounding box that intersects the given Outline.